In [1]:
import pandas as pd
import numpy as np
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:root@localhost/movies"

In [2]:
engine = create_engine(connection_str)

In [3]:
# Load in the dataframe from project part 1 as basics:
title_basics = pd.read_csv('Data/basics.csv.gz')
title_basics.drop(columns=['titleType','originalTitle','isAdult','endYear'],inplace=True)
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama
2,tt0069049,The Other Side of the Wind,2018,122,Drama
3,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002,126,Drama

In [4]:
# Load in the dataframe from project part 1 as basics:
title_ratings = pd.read_csv('Data/ratings.csv.gz')
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1922
1  tt0000002            5.8       259
2  tt0000005            6.2      2544
3  tt0000006            5.1       175
4  tt0000007            5.4       797

In [5]:
tmdb_data = pd.read_csv("Data/tmdb_results_combined.csv.gz",usecols=['imdb_id','revenue','budget','certification'])
tmdb_data.rename(columns={"imdb_id": "tconst"},inplace=True)
tmdb_data.head()

      tconst      budget     revenue certification
0          0         NaN         NaN           NaN
1  tt0113026  10000000.0         0.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694    150000.0  12854953.0            PG

In [6]:
#tmdb_data.loc[tmdb_data['tconst'] == '0']
tmdb_data = tmdb_data[tmdb_data.tconst != '0']

In [7]:
## create a col with a list of genres
title_basics['genres_split'] = title_basics['genres'].str.split(',')
title_basics

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,Crime and Punishment,2002,126,Drama,[Drama]
...,...,...,...,...,...,...
79856,tt9914942,Life Without Sara Amat,2019,74,Drama,[Drama]
79857,tt9915872,The Last White Witch,2019,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
79858,tt9916170,The Rehearsal,2019,51,Drama,[Drama]
79859,tt9916190,Safeguard,2020,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
79860,tt9916362,Coven,2020,92,"Drama,History","[Drama, History]"

In [8]:
exploded_genres = title_basics.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018,122,Drama,Drama
...,...,...,...,...,...,...
79859,tt9916190,Safeguard,2020,95,"Action,Adventure,Thriller",Action
79859,tt9916190,Safeguard,2020,95,"Action,Adventure,Thriller",Adventure
79859,tt9916190,Safeguard,2020,95,"Action,Adventure,Thriller",Thriller
79860,tt9916362,Coven,2020,92,"Drama,History",Drama
79860,tt9916362,Coven,2020,92,"Drama,History",History

In [9]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [10]:
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [11]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [12]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [13]:
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
79859  tt9916190         0
79859  tt9916190         2
79859  tt9916190        23
79860  tt9916362         7
79860  tt9916362        11

[149605 rows x 2 columns]

In [14]:
genres = pd.DataFrame({'Genre_Name': genre_map.keys(), 'Genre_ID': genre_map.values()})

In [15]:
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [16]:
title_basics

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,Crime and Punishment,2002,126,Drama,[Drama]
...,...,...,...,...,...,...
79856,tt9914942,Life Without Sara Amat,2019,74,Drama,[Drama]
79857,tt9915872,The Last White Witch,2019,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
79858,tt9916170,The Rehearsal,2019,51,Drama,[Drama]
79859,tt9916190,Safeguard,2020,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
79860,tt9916362,Coven,2020,92,"Drama,History","[Drama, History]"

In [17]:
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()}

In [18]:
title_basics.drop(columns=['genres','genres_split'],inplace=True)

In [19]:
# Save to sql with dtype and index=False
title_basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [20]:
## Create a schema dictonary using Sqlalchemy datatype objects
df2_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [21]:
# Save to sql with dtype and index=False
title_ratings.to_sql('title_ratings',engine,dtype=df2_schema,if_exists='replace',index=False)
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [22]:
## Create a schema dictonary using Sqlalchemy datatype objects
df3_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Integer()}

In [23]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=df3_schema,if_exists='replace',index=False)

149605

In [24]:
## get max string length
genre_len = genres['Genre_Name'].fillna('').map(len).max()

In [25]:
## Create a schema dictonary using Sqlalchemy datatype objects
df4_schema = {
    "Genre_Name": String(genre_len+1), 
    'Genre_ID':Integer()}

In [26]:
# Save to sql with dtype and index=False
genres.to_sql('genres',engine,dtype=df4_schema,if_exists='replace',index=False)

26

In [27]:
## get max string length
cert_len = tmdb_data['certification'].fillna('').map(len).max()

In [28]:
## Create a schema dictonary using Sqlalchemy datatype objects
df5_schema = {
    "tconst": String(key_len+1), 
    'budget':Float(),
    'revenue':Float(),
    'certification':String(cert_len+1)}

In [29]:
# Save to sql with dtype and index=False
tmdb_data.to_sql('tmdb_data',engine,dtype=df5_schema,if_exists='replace',index=False)
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`tconst`);')

In [31]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data